Autodesk.Revit.DB.DirectShape.GetDirectContextTransform
Gets the transform representing the transformation needed to transform the orginal
DirectContext3D in this DirectShape from its original position and orientation to its
current position and orientation.
Returns:
The transform.
Since:
2015

Autodesk.Revit.DB.DirectShape.CanCreateParts
Indicates if it is possible to create parts from this DirectShape element.
Remarks:
While it is generally possible to create parts from DirectShape elements, some characteristics make parts creation impossible.
This property is re-evaluated every time the element's geometry is modified (via a call to SetShape or AppendShape).
Invalid configurations include: DirectShape elements containing a polymesh, or an open geometry, as well as DirectShape elements
not containing any solids and DirectShape elements configured as NotReferenceable (via a call to SetOptions).
Finally, if a DirectShape element has DirectShapeType instances in its geometry, and one of those DirectShapeTypes has a configuration
that is incompatible with parts creation, the DirectShape element will also be incompatible with parts creation.
Returns:
True if it is possible to create parts from this DirectShape.
Since:
2020

Autodesk.Revit.DB.DirectShape.IsValidShape(System.Collections.Generic.IList{Autodesk.Revit.DB.GeometryObject},Autodesk.Revit.DB.DirectShapeTargetViewType)
Validates view-specific shape to be stored in a DirectShape. Expects a non-default view type.
shape:
Shape of this object expressed as a collection of GeometryObjects.
For viewType = DirectShapeTargetViewType::Default, the supported types of GeometryObjects are: Solid, Mesh, GeometryInstance, Point and Curve.
For viewType = DirectShapeTargetViewType::Plan, the supported types of GeometryObjects are: Point and Curve.
viewType:
The view type this shape is intended for.
Returns:
True if the supplied shape passes the validation criteria.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2017

Autodesk.Revit.DB.DirectShape.IsValidShape(System.Collections.Generic.IList{Autodesk.Revit.DB.GeometryObject})
Validates shape to be stored in a DirectShape. Supercedes and extends IsValidGeometry().
Remarks:
This function calls IsValidShape(GeometryObject) to validate each object in the list.
shape:
Shape to be validated represented as a collection of GeometryObjects.
The supported types of GeometryObjects are: Solid, Mesh, GeometryInstance, Point and Curve.
Returns:
True if the supplied shape passes the validation criteria.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.DirectShape.IsValidGeometry(Autodesk.Revit.DB.Solid)
Validates geometry to be stored in a DirectShape. Suitable geometry validation is performed. Additionally, the geometry
must make sense as a shape representation for the category assigned to this DirectShape object.
Geom:
GeometryObject to be validated.
Returns:
True if the supplied GeometryObject passes the validation criteria.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.DirectShape.IsValidTypeId(Autodesk.Revit.DB.ElementId)
Tests the type id to make sure it satisfies the following conditions
It is a valid element id.It corresponds to a valid DirectShapeType.The DirectShapeType has the same category assigned.
Additionally, this functions tests that the current type id in this DirectShape is invalid.
The type id is initialized to invalidElementId by the create functions. Once it is set, it may no longer be changed.
typeId:
Type id to be tested.
Returns:
False unless typeId satisfies the conditions listed above and the type id of this object was not set previously.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.DirectShape.IsSupportedDocument(Autodesk.Revit.DB.Document)
Tests whether a DirectShape or a DirectShapeType may be created in this document.
Remarks:
Some types of Document, such as 2D families, can't support DirectShape functionality.
document:
Document to be tested.
Returns:
True if a DirectShape or a DirectShapeType object can be created in this document, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.DirectShape.IsValidCategoryId(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Document)
Test the category id to make sure the category is allowed for a DirectShape or DirectShapeType.
categoryId:
Category id to be tested.
doc:
Document to look up the category by id.
Returns:
True if the category is allowed for a DirectShape or DirectShapeType, false if not.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.DirectShape.SetOptions(Autodesk.Revit.DB.DirectShapeOptions)
Sets the options to use for this DirectShape.
Remarks:
The new options take effect immediately.
If this DirectShape relies on a DirectShapeType for references, the options stored in DirectShapeType take precedence.
Note that changing options affects how the object interacts with Revit. E.g., switching references off will disable
existing constraints applied to that object.
options:
Options to use for this DirectShape.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The DirectShapeOptions provided are not valid for this DirectShape.
-or-
The DirectShapeOptions provided are not valid for this transient DirectShape.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.DirectShape.AreOptionsValidForTransientDirectShape(Autodesk.Revit.DB.DirectShapeOptions)
Validates that the given DirectShapeOptions are allowed if this DirectShape is transient.
options:
The options object.
Returns:
True if the DirectShapeOptions are valid; false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.DirectShape.AreOptionsValid(Autodesk.Revit.DB.DirectShapeOptions)
Validates that the given DirectShapeOptions are allowed for this particular DirectShape.
options:
The options object.
Returns:
True if the DirectShapeOptions are valid; false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.DirectShape.HasExternalGeometry(Autodesk.Revit.DB.ExternalGeometryId)
Checks whether the externally tagged geometry is already present in this DirectShape.
externalId:
The external ID of the externally tagged geometry to check.
Returns:
True if such an externally tagged geometry is already present in this DirectShape, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShape.ResetExternallyTaggedGeometry
Removes all of the externally tagged geometry in this DirectShape.
Since:
2022

Autodesk.Revit.DB.DirectShape.RemoveExternallyTaggedGeometry(Autodesk.Revit.DB.ExternalGeometryId)
Removes the externally tagged geometry object by its external ID from this DirectShape.
externalId:
The external ID of the externally tagged geometry that should be removed.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The externally tagged geometry with the input externalId is not present in this DirectShape.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShape.UpdateExternallyTaggedGeometry(Autodesk.Revit.DB.ExternallyTaggedGeometryObject)
Updates the externally tagged geometry object in the DirectShape.
externallyTaggedGeometry:
The externally tagged geometry that should be updated in the DirectShape.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input shape does not satisfy DirectShape validation criteria.
-or-
A previous version of the externally tagged geometry is not present in this DirectShape.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShape.GetExternallyTaggedGeometry(Autodesk.Revit.DB.ExternalGeometryId)
Gets the externally tagged geometry by its external ID that is stored in this DirectShape.
externalId:
The external ID of the externally tagged geometry that should be obtained.
Returns:
The externally tagged geometry.
Or null if there is no such an externally tagged geometry in the DirectShape.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShape.AddExternallyTaggedGeometry(Autodesk.Revit.DB.ExternallyTaggedGeometryObject)
Adds the externally tagged geometry object to the DirectShape.
externallyTaggedGeometry:
The externally tagged geometry that should be added to the DirectShape.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input shape does not satisfy DirectShape validation criteria.
-or-
The input geometry does not have a permitted usage.
-or-
The externallyTaggedGeometry has already been added to this DirectShape.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShape.IsValidUsage(Autodesk.Revit.DB.ExternallyTaggedGeometryObject)
Validates that the ExternallyTaggedGeometryObject's usage is set to an allowed value for a DirectShape.
externallyTaggedGeometry:
The geometry to check.
Returns:
True if the usage is permitted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.DirectShape.IsValidShape(Autodesk.Revit.DB.ExternallyTaggedGeometryObject)
Validates shape to be stored in a DirectShape.
Remarks:
This function uses the same criteria as IsValidShape(GeometryObject).
externallyTaggedGeometry:
The supported types of GeometryObjects are: Solid, Mesh, GeometryInstance, Point and Curve.
Returns:
True if the supplied shape passes the validation criteria.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.DirectShape.IsValidReferencePlaneBoundingBoxUV(Autodesk.Revit.DB.BoundingBoxUV)
Validates that the input BoundingBoxUV is suitable for bounding a reference plane surface.
The input BoundingBoxUV must be set and not degenerate.
boundingBoxUV:
The reference plane BoundingBoxUV to test.
Returns:
True if the input BoundingBoxUV is valid for reference plane surfaces, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShape.IsValidReferenceCurve(Autodesk.Revit.DB.Curve)
Validates that the input curve is suitable for creating a direct shape reference curve.
Bounded and unbounded lines are accepted.
Other bounded and unbounded curve types with natural bounds are accepted if they are not closed.
Unbounded periodic curves are not allowed.
curve:
The curve to test.
Returns:
True if the input curve point can be used to create a direct shape reference curve, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShape.AreValidDirectShapeReferenceOptions(Autodesk.Revit.DB.DirectShapeReferenceOptions)
Validates that the input DirectShapeReferenceOptions are suitable for creating a direct shape reference object.
If the options specify an ExternalGeometryId, it must not correspond to any existing reference object
belonging to the DirectShape.
options:
The options to test.
Returns:
True if the options can be used to add a reference object to this DirectShape.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.DirectShape.RemoveAllReferenceObjects
Removes all reference objects (if any) from the DirectShape.
Since:
2024

Autodesk.Revit.DB.DirectShape.RemoveReferenceObject(Autodesk.Revit.DB.ExternalGeometryId)
Removes any reference object associated with the provided ExternalGeometryId from the DirectShape.
Nothing is done if no reference object has the given external ID or if the external ID is an empty string.
externalId:
The ExternalGeometryId of the reference object to be removed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.DirectShape.RemoveReferenceObject(System.String)
Removes any reference objects with the given name from the DirectShape.
Nothing is done if no reference objects have the given name or if the name is the empty string.
refName:
The name of the reference object(s) to be removed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.DirectShape.AddReferencePoint(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.DirectShapeReferenceOptions)
Adds a reference point to the DirectShape.
refPoint:
The coordinates of the new reference point.
options:
The options that are used to configure the new reference point.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input point lies outside of Revit design limits.
-or-
options cannot be used to add a reference object to this DirectShape.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShape.AddReferencePoint(Autodesk.Revit.DB.XYZ)
Adds a reference point to the DirectShape.
refPoint:
The coordinates of the new reference point.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input point lies outside of Revit design limits.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShape.AddReferencePlane(Autodesk.Revit.DB.Plane,Autodesk.Revit.DB.BoundingBoxUV,Autodesk.Revit.DB.DirectShapeReferenceOptions)
Adds a reference plane to the DirectShape. The reference plane can either be bounded or unbounded.
refPlane:
The geometry of the new reference plane.
boundingBoxUV:
If boundingBoxUV is set, the resulting reference plane that is added to the DirectShape will be displayed
with those bounds. Note that the specified bounds must not be degenerate.
If boundingBoxUV is not set, reasonable bounds are automatically calculated and applied to the input plane.
The automatic bounds are based on the host direct shape's geometry.
options:
The options that are used to configure the new reference plane.
Throws Autodesk.Revit.Exceptions.ArgumentException:
boundingBoxUV cannot be used as a BoundingBoxUV for the reference plane surface.
-or-
options cannot be used to add a reference object to this DirectShape.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShape.AddReferencePlane(Autodesk.Revit.DB.Plane,Autodesk.Revit.DB.DirectShapeReferenceOptions)
Adds a reference plane to the DirectShape. The reference plane can either be bounded or unbounded.
refPlane:
The geometry of the new reference plane.
options:
The options that are used to configure the new reference plane.
Throws Autodesk.Revit.Exceptions.ArgumentException:
options cannot be used to add a reference object to this DirectShape.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShape.AddReferencePlane(Autodesk.Revit.DB.Plane,Autodesk.Revit.DB.BoundingBoxUV)
Adds a reference plane to the DirectShape. The reference plane can either be bounded or unbounded.
refPlane:
The geometry of the new reference plane.
boundingBoxUV:
If boundingBoxUV is set, the resulting reference plane that is added to the DirectShape will be displayed
with those bounds. Note that the specified bounds must not be degenerate.
If boundingBoxUV is not set, reasonable bounds are automatically calculated and applied to the input plane.
The automatic bounds are based on the host direct shape's geometry.
Throws Autodesk.Revit.Exceptions.ArgumentException:
boundingBoxUV cannot be used as a BoundingBoxUV for the reference plane surface.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShape.AddReferencePlane(Autodesk.Revit.DB.Plane)
Adds a reference plane to the DirectShape. The reference plane can either be bounded or unbounded.
refPlane:
The geometry of the new reference plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShape.AddReferenceCurve(Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.DirectShapeReferenceOptions)
Adds a reference curve to the DirectShape.
refCurve:
The geometry of the new reference curve.
First case: The input curve's bounds are set. The resulting reference curve that is added to the
DirectShape will be displayed with those bounds. Note that the specified bounds must not be degenerate.
Second case: The input curve is unbounded. Reasonable bounds are therefore automatically calculated
and applied to the input curve. The automatic bounds are based on the host direct shape's geometry.
Note that only lines and splines may be unbounded. You must specify valid bounds for all other curve types.
options:
The options that are used to configure the new reference curve.
Throws Autodesk.Revit.Exceptions.ArgumentException:
refCurve cannot be used for creating a reference curve.
-or-
options cannot be used to add a reference object to this DirectShape.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShape.AddReferenceCurve(Autodesk.Revit.DB.Curve)
Adds a reference curve to the DirectShape.
refCurve:
The geometry of the new reference curve.
First case: The input curve's bounds are set. The resulting reference curve that is added to the
DirectShape will be displayed with those bounds. Note that the specified bounds must not be degenerate.
Second case: The input curve is unbounded. Reasonable bounds are therefore automatically calculated
and applied to the input curve. The automatic bounds are based on the host direct shape's geometry.
Note that only lines and splines may be unbounded. You must specify valid bounds for all other curve types.
Throws Autodesk.Revit.Exceptions.ArgumentException:
refCurve cannot be used for creating a reference curve.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShape.GetExternallyTaggedReference(Autodesk.Revit.DB.ExternalGeometryId)
Retrieve a Reference to reference geometry of the DirectShape that is associated with a particular ExternalGeometryId.
externalId:
The ExternalGeometryId of the requested reference object.
Returns:
A Reference to the externally tagged reference GeometryObject having the provided external ID
or null if there is no reference geometry having the external ID.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.DirectShape.HasExternallyTaggedReference(Autodesk.Revit.DB.ExternalGeometryId)
Checks if the externally tagged reference is already present in this DirectShape.
externalId:
The external ID of the tagged reference to check for.
Returns:
True if the DirectShape holds a reference with the specified ExternalGeometryId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.DirectShape.AppendShape(Autodesk.Revit.DB.ShapeBuilder)
Appends shape built by the supplied ShapeBuilderObject to shape representation stored in this DirectShape.
The data stored in the supplied ShapeBuilder object will be cleared.
Remarks:
The existing shape will not be cleared by this function, and intersecting or overlapped geometry will not be
joined with the appended geometry. It is up to the caller to ensure that the combination of geometry
will have the correct appearance in Revit.
This function will bypass extra geometry validation because the built geometry has already been validated by the ShapeBuilder.
It is therefore slightly more efficient than the AppendShape() routine that accepts GeometryObjects directly as input.
ShapeBuilder:
The ShapeBuilder object that was used to build the shape to be appended.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.DirectShape.AppendShape(System.Collections.Generic.IList{Autodesk.Revit.DB.GeometryObject},Autodesk.Revit.DB.DirectShapeTargetViewType)
Appends the collection of GeometryObjects into the model or view specific shape representation stored in this DirectShape.
Passing DirectShapeTargetViewType.Default as view type will cause the model shape to be updated.
Remarks:
The existing shape will not be cleared by this function, and intersecting or overlapped geometry will not be
joined with the appended geometry. It is up to the caller to ensure that the combination of geometry
will have the correct appearance in Revit.
pGeomArr:
Shape expressed as a collection of GeometryObjects.
For viewType = DirectShapeTargetViewType::Default, the supported types of GeometryObjects are: Solid, Mesh, GeometryInstance, Point and Curve.
For viewType = DirectShapeTargetViewType::Plan, the supported types of GeometryObjects are: Point and Curve.
viewType:
Passing DirectShapeTargetViewType.Default as view type will cause the default shape to be appended.
Throws Autodesk.Revit.Exceptions.ArgumentException:
At least one member of pGeomArr does not satisfy DirectShape validation criteria.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.DB.DirectShape.AppendShape(System.Collections.Generic.IList{Autodesk.Revit.DB.GeometryObject})
Appends the collection of GeometryObjects into the model shape representation stored in this DirectShape.
Remarks:
The existing shape will not be cleared by this function, and intersecting or overlapped geometry will not be
joined with the appended geometry. It is up to the caller to ensure that the combination of geometry
will have the correct appearance in Revit.
pGeomArr:
Shape expressed as a collection of GeometryObjects.
The supported types of GeometryObjects are: Solid, Mesh, GeometryInstance, Point and Curve.
Throws Autodesk.Revit.Exceptions.ArgumentException:
At least one member of pGeomArr does not satisfy DirectShape validation criteria.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.DirectShape.SetShape(Autodesk.Revit.DB.ShapeBuilder)
Sets the shape of this object to the one accumulated in the supplied Builder object.
If the new shape is identical to the old one, the old shape will be kept.
Remarks:
This function will bypass extra geometry validation because the built geometry has already been validated by the ShapeBuilder.
It is therefore slightly more efficient than the SetShape() routine that accepts GeometryObjects directly as input.
Supplying a ViewShapeBuilder object as argument will cause the view-specific shape of this DirectShape to be updated.
Supplying other ShapeBuilder types will update the model shape.
pBuilder:
A ShapeBuilder object that was used to successfully build geometry to store in this DirectShape.
The built shape will be transferred to the DirectShape, and the ShapeBuilder object will be reset.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.DirectShape.SetShape(System.Collections.Generic.IList{Autodesk.Revit.DB.GeometryObject},Autodesk.Revit.DB.DirectShapeTargetViewType)
Builds the shape of this object from the supplied collection of GeometryObjects. The objects are copied.
If the new shape is identical to the old one, the old shape will be kept.
pGeomArr:
Shape of this object expressed as a collection of GeometryObjects.
For viewType = DirectShapeTargetViewType::Default, the supported types of GeometryObjects are: Solid, Mesh, GeometryInstance, Point and Curve.
For viewType = DirectShapeTargetViewType::Plan, the supported types of GeometryObjects are: Point and Curve.
viewType:
Optional: set a view-specific shape representation that will be used in views of that type only.
Passing DirectShapeTargetViewType::Default as view type will cause the default shape to be set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
At least one member of pGeomArr does not satisfy DirectShape validation criteria.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.DirectShape.SetShape(System.Collections.Generic.IList{Autodesk.Revit.DB.GeometryObject})
Builds the shape of this object from the supplied collection of GeometryObjects. The objects are copied.
If the new shape is identical to the old one, the old shape will be kept.
pGeomArr:
Shape of this object expressed as a collection of GeometryObjects.
The supported types of GeometryObjects are: Solid, Mesh, GeometryInstance, Point and Curve.
Throws Autodesk.Revit.Exceptions.ArgumentException:
At least one member of pGeomArr does not satisfy DirectShape validation criteria.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.DirectShape.SetName(System.String)
Sets the name for the DirectShape element.
name:
The name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.DirectShape.SetTypeId(Autodesk.Revit.DB.ElementId)
Sets the DirectShapeType for the DirectShape element.
typeId:
The ID of the type corresponding to this DirectShape element. May only be set once.
Throws Autodesk.Revit.Exceptions.ArgumentException:
typeId is not a valid Element identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.DirectShape.CreateElementInstance(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.String,Autodesk.Revit.DB.Transform)
Creates a DirectShape object and adds it to document.
Remarks:
This function is included for convenience. It essentially combines CreateGeometryInstance and CreateElement.
The shape stored in the element is either a reference or a copy of a definition shape that was created earlier.
How the definitions are stored will determine whether an instance or a copy of the shape will be created.
The intended use is to support a definition/instance pattern common in CAD formats - DWG blocks, STEP MAPPED_ITEM, IFC IfcMappedItem.
Use DirectShapeLibrary class to store definitions prior to using them here.
document:
Document to which the created element will be added.
typeId:
Element id of a DirectShapeType element.
categoryId:
Id of the category assigned to this DirectShape. Must be a valid category id.
definitionId:
Id of the shape definition that was created earlier and stored via DirectShapeLibrary.
trf:
Transform to be applied to the definition.
Returns:
The created DirectShape object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Document document may not contain DirectShape or DirectShapeType objects.
-or-
Element id categoryId may not be used as a DirectShape category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.DirectShape.CreateGeometryInstance(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.Transform)
Creates a copy of a definition shape that was created earlier.
Remarks:
Use DirectShapeLibrary class to store definitions prior to using them here.
How the definitions are stored will determine whether an instance or a copy of the shape will be created.
Use the output of this function as input to CreateElement to make the created shape persistent.
This is intended to support a definition/instance pattern common in CAD formats - DWG blocks, STEP MAPPED_ITEM, IFC IfcMappedItem.
document:
Document to which the created element will be added
definition_id:
ID of the shape definition that was created earlier and stored via DirectShapeLibrary
trf:
Transform to be applied to the definition
Returns:
A collection of GeometryObjects representing a placed instance of the pre-defined shape
The caller function takes ownership
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.DirectShape.CreateElement(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Creates a DirectShape object and adds it to document.
document:
Document to which the created element will be added.
categoryId:
Id of the category assigned to this DirectShape. Must be a valid category id.
Returns:
The created DirectShape object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Document document may not contain DirectShape or DirectShapeType objects.
-or-
Element id categoryId may not be used as a DirectShape category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.DirectShape.ApplicationDataId
A text string that identifies the data to the creating application.
Remarks:
The intended use is to enable the creating application to identify the native data that was the source of this DirectShape.
However, the creating application may use any text string as appropriate for its purposes, or leave this property unset.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.DirectShape.ApplicationId
A text string that identifies the creating application.
Remarks:
The creating application may use any text string as appropriate for its purposes, or leave this property unset.
One option is to use Application.ActiveAddInId for a unique application id, or concatenate it with an application name for a more informative, but still unique id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017